## 1- Imports

In [3]:
import pandas as pd
import numpy as np

## 2- DataFrame Titres et Entrées

In [4]:
df = pd.read_csv('allocine_films/films_data.csv')

In [5]:
df

                                  Titre            Entrées
0                      Fast & Furious X  1 140 846,514 473
1                              Joy Ride          9 258,772
2                              Passages       11 227,4 894
3                                  Moka      85 331,55 822
4                 Dernière nuit à Milan      40 869,24 465
...                                 ...                ...
114266              Le Vol de l'abeille                NaN
114267                    Feast of July                NaN
114268             A Fever in the Blood                NaN
114269                           Family                NaN
114270  Les Aventures de Robert Macaire                NaN

[114271 rows x 2 columns]

In [6]:
df = df.dropna()

In [7]:
df

                        Titre            Entrées
0            Fast & Furious X  1 140 846,514 473
1                    Joy Ride          9 258,772
2                    Passages       11 227,4 894
3                        Moka      85 331,55 822
4       Dernière nuit à Milan      40 869,24 465
...                       ...                ...
103633   La Mare aux miracles          3 600 000
104713                 Omkara            427 400
107188      Ways of the Flesh            540 000
109829      Aynehaye Rooberoo       14 181,7 222
110180        Pulling Strings          2 500 000

[10210 rows x 2 columns]

In [8]:
df['Entrées'] = df['Entrées'].str.replace(' ', '')

/tmp/ipykernel_360018/614287189.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Entrées'] = df['Entrées'].str.replace(' ', '')

In [9]:

df[['Entrées_1', 'Entrées_2']] = df['Entrées'].str.split(',', expand=True)

/tmp/ipykernel_360018/3236612321.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['Entrées_1', 'Entrées_2']] = df['Entrées'].str.split(',', expand=True)
/tmp/ipykernel_360018/3236612321.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['Entrées_1', 'Entrées_2']] = df['Entrées'].str.split(',', expand=True)

In [10]:
df['Entrées_1'] = pd.to_numeric(df['Entrées_1'], errors='coerce').astype('Int64')
df['Entrées_2'] = pd.to_numeric(df['Entrées_2'], errors='coerce').astype('Int64')

/tmp/ipykernel_360018/4218130270.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Entrées_1'] = pd.to_numeric(df['Entrées_1'], errors='coerce').astype('Int64')
/tmp/ipykernel_360018/4218130270.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Entrées_2'] = pd.to_numeric(df['Entrées_2'], errors='coerce').astype('Int64')

In [11]:
df

                        Titre         Entrées  Entrées_1  Entrées_2
0            Fast & Furious X  1140846,514473    1140846     514473
1                    Joy Ride        9258,772       9258        772
2                    Passages      11227,4894      11227       4894
3                        Moka     85331,55822      85331      55822
4       Dernière nuit à Milan     40869,24465      40869      24465
...                       ...             ...        ...        ...
103633   La Mare aux miracles         3600000    3600000       <NA>
104713                 Omkara          427400     427400       <NA>
107188      Ways of the Flesh          540000     540000       <NA>
109829      Aynehaye Rooberoo      14181,7222      14181       7222
110180        Pulling Strings         2500000    2500000       <NA>

[10210 rows x 4 columns]

## 3- Choix entre Entrées_1 et Entrées_2

In [12]:
print(df[df['Entrées_1'] >= df['Entrées_2']])

                        Titre            Entrées  Entrées_1  Entrées_2
0            Fast & Furious X     1140846,514473    1140846     514473
1                    Joy Ride           9258,772       9258        772
2                    Passages         11227,4894      11227       4894
3                        Moka        85331,55822      85331      55822
4       Dernière nuit à Milan        40869,24465      40869      24465
...                       ...                ...        ...        ...
100711      Un film d’oeufs 3    3424702,2024134    3424702    2024134
101600                 Amparo   10710000,5400000   10710000    5400000
101898          The Foresaken    3000000,1500000    3000000    1500000
103350        Le Long silence  46300000,15800000   46300000   15800000
109829      Aynehaye Rooberoo         14181,7222      14181       7222

[8710 rows x 4 columns]

In [13]:
print(df[df['Entrées_1'] < df['Entrées_2']])

                                                Titre          Entrées  \
8                                      Pop Redemption       1599,56964
24                                        Élémentaire    426818,537921
25      Mission: Impossible – Dead Reckoning Partie 1  930141,54688347
41                                          The Whale      65064,69274
66                          LOL (Laughing Out Loud) ®    738734,806131
...                                               ...              ...
46861                              La Beauté du geste    211000,264567
49519                              La Route du soleil            32,36
50101                                    Next Day Air   190000,4111043
50562                 Kit Kittredge: An American Girl   220297,3296929
103028                                         O'More  7400000,9200000

        Entrées_1  Entrées_2
8            1599      56964
24         426818     537921
25         930141   54688347
41          65064      69274
66         738734     806131
...           ...        ...
46861      211000     264567
49519          32         36
50101      190000    4111043
50562      220297    3296929
103028    7400000    9200000

[719 rows x 4 columns]

In [14]:
# Fonction personnalisée pour appliquer les conditions
def calc_entrées(row):
    if pd.notnull(row['Entrées_2']):
        if row['Entrées_2'] > 10 * row['Entrées_1']:
            return row['Entrées_2']
        else:
            return row['Entrées_1']
    return row['Entrées_1']

# Appliquer la fonction pour créer la nouvelle colonne 'Entrées_1ère_semaine'
df['Entrées_1ère_semaine'] = df.apply(calc_entrées, axis=1)

/tmp/ipykernel_360018/1118121944.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Entrées_1ère_semaine'] = df.apply(calc_entrées, axis=1)

In [15]:
print(df[df['Entrées_1'] < df['Entrées_2']])

                                                Titre          Entrées  \
8                                      Pop Redemption       1599,56964
24                                        Élémentaire    426818,537921
25      Mission: Impossible – Dead Reckoning Partie 1  930141,54688347
41                                          The Whale      65064,69274
66                          LOL (Laughing Out Loud) ®    738734,806131
...                                               ...              ...
46861                              La Beauté du geste    211000,264567
49519                              La Route du soleil            32,36
50101                                    Next Day Air   190000,4111043
50562                 Kit Kittredge: An American Girl   220297,3296929
103028                                         O'More  7400000,9200000

        Entrées_1  Entrées_2  Entrées_1ère_semaine
8            1599      56964                 56964
24         426818     537921                426818
25         930141   54688347              54688347
41          65064      69274                 65064
66         738734     806131                738734
...           ...        ...                   ...
46861      211000     264567                211000
49519          32         36                    32
50101      190000    4111043               4111043
50562      220297    3296929               3296929
103028    7400000    9200000               7400000

[719 rows x 5 columns]

In [16]:
df

,Titre,Entrées,Entrées_1,Entrées_2,Entrées_1ère_semaine
0,Fast & Furious X,"1140846,514473",1140846,514473,1140846
1,Joy Ride,"9258,772",9258,772,9258
2,Passages,"11227,4894",11227,4894,11227
3,Moka,"85331,55822",85331,55822,85331
4,Dernière nuit à Milan,"40869,24465",40869,24465,40869
...,...,...,...,...,...
103633,La Mare aux miracles,3600000,3600000,<NA>,3600000
104713,Omkara,427400,427400,<NA>,427400
107188,Ways of the Flesh,540000,540000,<NA>,540000
109829,Aynehaye Rooberoo,"14181,7222",14181,7222,14181
110180,Pulling Strings,2500000,2500000,<NA>,2500000

## 4- DataFrame Titre et Entrées 1ère semaine

In [17]:
df = df[['Titre', 'Entrées_1ère_semaine']]

In [18]:
df

                        Titre  Entrées_1ère_semaine
0            Fast & Furious X               1140846
1                    Joy Ride                  9258
2                    Passages                 11227
3                        Moka                 85331
4       Dernière nuit à Milan                 40869
...                       ...                   ...
103633   La Mare aux miracles               3600000
104713                 Omkara                427400
107188      Ways of the Flesh                540000
109829      Aynehaye Rooberoo                 14181
110180        Pulling Strings               2500000

[10210 rows x 2 columns]

In [19]:
duplicate_rows = df[df.duplicated(subset='Titre', keep=False)]
duplicate_rows

                  Titre  Entrées_1ère_semaine
12     En eaux troubles                710798
26             Une nuit                 58679
28       Les Misérables                559378
74                 Coco                948846
118          Cendrillon                636418
...                 ...                   ...
38930          Kandahar               2410000
38992          Hypnotic               2355000
42758   Black Christmas               3723364
47414            Spiral               4550000
97709      Midnight Sun               4003993

[272 rows x 2 columns]

In [20]:
df[df['Titre']=='Midnight Sun']

              Titre  Entrées_1ère_semaine
5857   Midnight Sun                 49648
97709  Midnight Sun               4003993

In [21]:
df[df['Titre']=='Black Christmas']

                 Titre  Entrées_1ère_semaine
9077   Black Christmas                 64505
42758  Black Christmas               3723364

In [22]:
# Enlever les titres dupliqués en gardant celui avec le plus grand nombre d'entrées
df.drop_duplicates(subset='Titre', keep='last', inplace=True)

# Réinitialiser les index du DataFrame après la suppression des doublons
df.reset_index(drop=True, inplace=True)

/tmp/ipykernel_360018/3731102788.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop_duplicates(subset='Titre', keep='last', inplace=True)

In [23]:
df

                       Titre  Entrées_1ère_semaine
0           Fast & Furious X               1140846
1                   Joy Ride                  9258
2                   Passages                 11227
3                       Moka                 85331
4      Dernière nuit à Milan                 40869
...                      ...                   ...
10066   La Mare aux miracles               3600000
10067                 Omkara                427400
10068      Ways of the Flesh                540000
10069      Aynehaye Rooberoo                 14181
10070        Pulling Strings               2500000

[10071 rows x 2 columns]

In [24]:
df[df['Titre']=='Midnight Sun']

              Titre  Entrées_1ère_semaine
10059  Midnight Sun               4003993

In [25]:
df[df['Titre']=='Black Christmas']

                Titre  Entrées_1ère_semaine
9901  Black Christmas               3723364

In [26]:
df.to_csv('allocine_titre_entrees.csv', index=False)